
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/yuita-yoshihiko/aws-ecs-terraform/actions/runs/5827279440)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06b8f27414d1cabf8]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0f0f5a7e5cce06140]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a7f1b532514522c6]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07392b2be2d18bf9c]
aws_security_group.ecs: Refreshing state... [id=sg-09dad8cc25e0acaa1]
aws_security_group.alb: Refreshing state... [id=sg-0a9d386fe1969d674]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f92484e7b5c3bc3d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08194cb55181a78fe]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0a8087efaf3b54d8d]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:targetgroup/go-simple-server-target-group/625447b11a80fc4c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0480925e51e99cc7a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0edd855a902645cb0]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-010c2c0524b144700]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b80ac677bb33214f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00f719498d88461c4]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:loadbalancer/app/go-simple-server-alb/dc64aee3ed3d3134]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3202176488]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0a33747bcbdddeb0b]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0daa3d3bd23fdf220]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00f719498d88461c41080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04f73d7f394b158f8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01957416a0ca6bf21]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e0b546d722c0f501]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0cef5de48e279d15c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-022cca83687a69979]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-070a6a32772284545]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0480925e51e99cc7a1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-08194cb55181a78fe1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:listener/app/go-simple-server-alb/dc64aee3ed3d3134/652045111d449a67]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:listener-rule/app/go-simple-server-alb/dc64aee3ed3d3134/652045111d449a67/335a8907ba45f676]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 2s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"d28d47751d8b5f28e5ac1bd2eb5bde5e16a02f0d","Vars":{},"WorkflowName":"Terraform"} -->